#Выпoлнил:Букин Илья 301818
#Задача 1:Поработайте с переменными, создайте несколько, выведите на экран,запросите у пользователя несколько чисел и строк и сохраните в переменные,выведите на экран.
a = input("Введите,пожалуйста, ваше имя: ")
b = int(input("Введите,пожалуйста, ваш возраст: "))
c = float(input("Введите,пожалуйста, любое число: "))

print(f"Имя: {a}  Возраст: {b}  Число: {c}")